import styled from "./shabek.module.css"
import { NavBar } from "../../componentes/NavBar/NavBar"
import isdn from "../../assets/images/isbn-location.png"
import { FontAwesomeIcon } from "@fortawesome/react-fontawesome"
import { faBook, faQuoteLeft } from "@fortawesome/free-solid-svg-icons"
import shabek from "../../assets/images/shabak-2.png"

export function Shabek() {
	return (
		<div className={styled.Shabek}>
			<NavBar />

			<section className={styled.head}>
				<div className={styled.logoContainer}><img src={isdn} alt="isdn logo" /></div>
				<div className={styled.info}>
					<FontAwesomeIcon icon={faQuoteLeft} />
					<h2>شابک چیست ؟</h2>
					<p>شابک (شماره استاندارد بین‌المللی کتاب) یک کد منحصربه‌فرد برای شناسایی کتاب‌ها در سطح جهانی است. این شماره ۱۳ رقمی به ناشران، کتابخانه‌ها و فروشندگان کمک می‌کند تا کتاب‌ها را به‌درستی دسته‌بندی و مدیریت کنند. در این صفحه، با ساختار شابک، کاربردهای آن و نحوه دریافت آن آشنا خواهید شد.</p>
				</div>
			</section>

			<section className={styled.history}>
				<FontAwesomeIcon icon={faBook} className={styled.bookSvg} />
				<div className={styled.textContent}>
					<FontAwesomeIcon icon={faQuoteLeft} />
					<h2>(ISBN) تاریخچه شابک</h2>
					<p>تاریخچه شابک (ISBN) به‌عنوان یک سیستم شناسایی بین‌المللی برای کتاب‌ها به نیاز روزافزون برای مدیریت و توزیع کتاب‌ها پاسخ می‌دهد. در دهه ۱۹۶۰، با گسترش انتشار کتاب و مشکلات موجود در توزیع و موجودی، ناشران به این فکر افتادند که یک شماره یکتا برای شناسایی کتاب‌ها ایجاد کنند. در سال ۱۹۶۷، در انگلستان شماره استاندارد کتاب توسط شرکت اسمیت معرفی شد و سپس این سیستم در همکاری با آمریکا توسعه یافت. این ایده در سال ۱۹۶۸ به‌طور رسمی در سطح بین‌المللی توسط سازمان‌های استاندارد سازی مورد توجه قرار گرفت و منجر به تأسیس سیستم شابک شد. شابک به‌طور رسمی در ایران از سال ۱۳۷۳ اجرایی شد و از آن زمان تاکنون هزاران ناشر از این سیستم برای شماره‌گذاری کتاب‌های خود استفاده می‌کنند.</p>
				</div>
			</section>

			<section className={styled.isbnIran}>
				<img src={shabek} alt="" />
				<div className={styled.textContent}>
					<FontAwesomeIcon icon={faQuoteLeft} />
					<h2>شابک در ایران</h2>
					<p>همگام با گسترش نشر کتاب و استفاده روزافزون از رایانه و سیستم های داده-پردازی در فعالیتهای نشر و اطلاع رسانی، ضرورت وجود شابک در ایران نیز بیش از پیش احساس شد و در نتیجه معاونت امور فرهنگی وزارت فرهنگ و ارشاد اسلامی به عنوان متولی کار نشر اقدام به اخذ نمایندگی از موسسه جهانی شابک نمود. در سال 1372، ایران به عضویت این مؤسسه درآمد و شماره گروهی جمهوری اسلامی ایران در نظام شماره گذاری بین المللی کتاب عدد 964 تعیین شد.

						بر اساس آمار خانه کتاب تعداد ناشران عضو بیش از 8000 ناشر است. همچنین بر اساس همین آمار از کل کتاب های منتشر شده توسط ناشران تا پایان سال 1390، حدود 96 درصد کتاب ها دارای شابک هستند. در سال 1375 نیز بر اساس مصوبه هیات وزيران استفاده از شابک از سوی ناشران اجباری شد و ناشر موظف شد که از ضوابط شابک ایران پیروی کند.</p>
				</div>
			</section>

			<section className={styled.numbering}>
				<h2>نظام شماره‌گذاری شابک در ایران</h2>
				<div className={styled.grups}>
					<div className={styled.grup}>
						<p>در شابک ایران دو میلیون عنوان کتاب با پیش شماره های 964 و 600 قابل شماره گذاری است که در آن ناشران، بر حسب میزان فعالیت انتشاراتی آنها، به گروه هایی تقسیم می شوند که جدول گروه 964 به صورت زیر است:
						</p>
						<div className={styled.grupNumbers}>
							<ul>
								<li>تا 10000 عنوان کتاب</li>
								<li>تا 1000 عنوان کتاب</li>
								<li>تا 1000 عنوان کتاب</li>
								<li>تا 1000 عنوان کتاب</li>
								<li>تا 100 عنوان کتاب</li>
								<li>تا 100 عنوان کتاب</li>
								<li>تا 100 عنوان کتاب</li>
								<li>تا 10 عنوان کتاب</li>
							</ul>
							<ul>
								<li>29-00 عنوان اول</li>
								<li>150-249 عنوان دوم</li>
								<li>300-540 عنوان سوم</li>
								<li>970-989 عنوان چهارم</li>
								<li>2500-2999 عنوان پنجم</li>
								<li>5500-8999 عنوان ششم</li>
								<li>9900-9999 عنوان هفتم</li>
								<li>90000-96999گروه هشتم</li>
							</ul>
						</div>
					</div>
					<div className={styled.grup}>
						<p>با توجه به افزایش میزان انتشارات و در شرف به اتمام رسیدن شماره های شابک در گروه 964 در سال 1385 گروه دیگری به شناسه 600 به ایران اختصاص یافت. دامنه شماره گذاری گروه 600 به شرح زیر است:
						</p>
						<div className={styled.grupNumbers}>
							<ul>
								<li>تا 10000 عنوان کتاب</li>
								<li>تا 1000 عنوان کتاب</li>
								<li>تا 100 عنوان کتاب</li>
								<li>تا 10 عنوان کتاب</li>
							</ul>
							<ul>
								<li>00-99 گروه اول</li>
								<li>100-499 گروه دوم</li>
								<li>5000-8999 گروه سوم</li>
								<li>90000-99999 گروه چهارم</li>
							</ul>
						</div>
					</div>
				</div>
			</section>

		</div>
	)
}