import styled from "./poetryAndSong.module.css"
import {NavBar} from "../../componentes/NavBar/NavBar";
import ferdosi from "../../assets/images/ferdosi.jpg"
import rodaci from "../../assets/images/rodaci.jpg"
import nima from "../../assets/images/nima.jpg"
import hafez from "../../assets/images/hafez.jpg"
import mehrdad from "../../assets/images/mehrdad.jpg"
import {FontAwesomeIcon} from "@fortawesome/react-fontawesome";
import {faQuoteLeft} from "@fortawesome/free-solid-svg-icons";

export function PoetryAndSong(){
  return (
    <div className={styled.poetryAndSong}>
      <NavBar />
      <section className={styled.headContainer}>
        <div className={styled.headImg}><img src={rodaci} />رودکی</div>
        <div className={styled.headTextContent}>
          <FontAwesomeIcon  icon={faQuoteLeft}/>
          <h2>ترانه</h2>
          <p>ترانه به شعری گفته می‌شود که قابلیت موسیقیایی داشته و در دوران معاصر، قافیه و عروض از پیش‌شرط‌های آن نیستند. درون‌مایه‌های ترانه‌ها معمولاً عامیانه و احساسی بوده و موضوعاتی مانند عشق، غربت، مبارزه با ظلم و ... را شامل می‌شوند. در قدیم، ترانه به معنای رباعی یا تصنیف سه‌گوشه به‌کار می‌رفت و گاه به معانی سرود، نوا و نغمه نیز استفاده می‌شد. ساختار ترانه از بندینه‌ها تشکیل می‌شود که معمولاً ۲ یا ۴ مصراع دارند و بخش تکرارشونده آن بندگردان نامیده می‌شود. زبان ترانه می‌تواند گفتاری یا نوشتاری باشد و ویژگی‌های اصلی آن شامل داشتن موسیقی، وزن عروضی و قافیه (ترجیحاً) و یک موضوع خاص است. از دههٔ پنجاه، با ظهور موسیقی پاپ، زبان ترانه به زبان گفتاری مردم نزدیک شد و تعریف آن تغییر کرد، اما از آن زمان تاکنون تغییر بنیادینی مانند آن دوره رخ نداده است.</p>
        </div>
      </section>
      <section className={styled.newPoetry}>
        <div className={styled.npImg}><img src={nima} />نیما یوشیج</div>
        <div className={styled.npTextContent}>
          <FontAwesomeIcon icon={faQuoteLeft}/>
          <h2>شعر سپید</h2>
          <p>شعر سپید یا شعر منثور گونه‌ای از شعر نو فارسی است که در دهه سی شمسی با مجموعهٔ «هوای تازه» از احمد شاملو ظهور کرد. تفاوت اصلی این سبک با شعرهای قبلی در فرم آن است، چراکه معمولاً وزن عروضی در آن رعایت نمی‌شود، اما آهنگ و موسیقی در آن نمود دارد. گاهی به هر شعری که در قالب شعر نیمایی نگنجد، شعر سپید گفته می‌شود. از نمونه‌های مشهور این سبک می‌توان به اشعاری از احمد شاملو مانند «سلاخی می‌گریست» و فروغ فرخزاد مانند «دلم گرفته است» اشاره کرد. تاریخچهٔ شعر سپید به سال ۱۳۲۶ و انتشار مجموعهٔ «آهنگ‌های فراموش شده» از شاملو بازمی‌گردد که نخستین نمونه‌های این سبک را در خود داشت. در دهه هشتاد شمسی نیز شاعران جوانی در تداوم شعر نو به تعادل خوبی در فرم و محتوا دست یافتند. از شاعران نامی این سبک می‌توان به احمد شاملو، فروغ فرخزاد، رضا براهنی، یغما گلرویی، سیدعلی موسوی گرمارودی و دیگران اشاره کرد.</p>
        </div>
      </section>
      <section className={styled.diferent}>
        <div className={styled.diImg}><img src={hafez} />حافظ شیرازی</div>
        <div className={styled.diTextContent}>
          <FontAwesomeIcon icon={faQuoteLeft}/>
          <h2>تمایز بین شعر و ترانه</h2>
          <p>بعضی به اشتباه، ترانه را معادل شعر می‌دانند. حال آنکه شعر چه در قالب شعر کلاسیک و چه در قالب شعر آزاد یک اتفاق ادبی صرف است که احساسی را با کمک کلمات و خیال‌پردازی به خواننده منتقل می‌کند که در هر دو سبک کلاسیک و آزاد مقتضیات و قواعد خاص خود را دارد.

            اما ترانه سروده‌ای است که به هدف هم آغوش شدن با موسیقی نوشته می‌شود. این نوشته باید بتواند برای قالب موسیقایی مدّ نظر سراینده یا آنچه با هماهنگی آهنگساز تعیین می‌شود، کارکرد مناسبی داشته باشد.

            شعر می‌تواند به عنوان ترانه هم استفاده شود (مانند شعرهای حافظ در موسیقی سنتی) اما ترانه محدود به شعر نیست. در ترانه الزامی به رعایت پارامترهای شعری نیست و مهم این است که ترانه بتواند با موسیقی مورد نظر یک ترکیب دلنشین ایجاد کند.

            خود متن ترانه از ارزشی ادبی متفاوت از شعر برخوردار است. ترانه راوی إحساسِ صرف ترانه‌سرا است ولی شعر حاوی نتیجه‌گیری‌های عقلی شاعر است.

            ترانه‌ها به خصوص در کارهای جدید مانند رپ یا راک و کارهای مدرن دیگر حتی از اول تا آخر یک ترانه می‌تواند با تغییر ریتم و وزن همراه باشد یا حتی در مواقعی بدون وزن باشد و یا هر نوآوری که ترانه‌سرا و آهنگ‌ساز برایش در نظر بگیرند مهم این است که مجموعه کار یک اثرِ قابل قبول از آب در بیاید.</p>
        </div>
      </section>
      <section className={styled.iranianPoetry}>
        <div className={styled.ipImg}><img src={mehrdad} />  مهرداد اوستا</div>
        <div className={styled.ipTextContent}>
          <FontAwesomeIcon icon={faQuoteLeft}/>
          <h2>شعر اصیل پارسی</h2>
          <p>شعر کلاسیک فارسی با قدمتی بیش از ۱۱۰۰ سال، بر پایهٔ وزن عروضی و قالب‌های مشخص هجایی شکل گرفته و ترکیبی از عاطفه و تخیل در زبان آهنگین است. شاعران بزرگی مانند فردوسی، مولوی، سعدی، حافظ، نظامی و صائب، با وجود تفاوت‌های سبکی، در ویژگی‌هایی مانند موسیقی، وزن عروضی، قافیه و ساختار مستحکم کلمات مشترک‌اند. تاریخچه شعر فارسی به سروده‌های گاهان زرتشت بازمی‌گردد، اما شعر عروضی فارسی از قرن سوم هجری و با حمایت سامانیان و شاعرانی مانند رودکی و فردوسی آغاز شد. در دوره‌های بعد، با پشتیبانی غزنویان و سلجوقیان، شعر فارسی به مناطق مرکزی و غربی ایران گسترش یافت و شاعران بزرگی مانند ناصر خسرو، خاقانی، نظامی و عطار ظهور کردند. در سده هفتم، سعدی و مولانا به اوج شعر فارسی رسیدند و پس از آن، سبک هندی با شاعرانی مانند صائب و بیدل ادامه یافت. در دوران مشروطه، شاعران نقش مهمی در تحولات اجتماعی داشتند و با ظهور نیما یوشیج، دوره شعر نو آغاز شد، اما شعر کلاسیک همچنان با شاعرانی مانند سیمین بهبهانی و مهرداد اوستا ادامه یافت.</p>
        </div>
      </section>
    </div>
  )
}