import styled from "./fipa.module.css"
import { NavBar } from "../../componentes/NavBar/NavBar"
import { useState } from "react"
import { FontAwesomeIcon } from "@fortawesome/react-fontawesome";
import { faCheck, faChildReaching, faCircleCheck, faClockRotateLeft, faGavel, faGlobe, faHome, faHouse, faMagnifyingGlass, faQuestion, faRedo, faTasks, faWebAwesome } from "@fortawesome/free-solid-svg-icons";

export function Fipa() {

  const [activeTab, setActiveTab] = useState("history");

  const tabs = [
    { id: "history", icon: faClockRotateLeft, label: " تاریخچه", content: `شکل ابتدایی و مختصر این طرح را در کتابهای چاپ سال ۱۳۴۶ به بعد دانشگاه تهران و ۱۳۴۹ به بعد خانقاه نعمت اللهی می توان دید. در سال ۱۳۷۱ کتابخانه ملی ایران این طرح را به طور آزمایشی با برخی از ناشران به اجرا گذاشت و پس از موفقیت نسبی پیشنهاد قانونی شدن آن ، طی طرحی در اسفند ۱۳۷۴ از سوی کتابخانه ملی به هیئت دولت ارائه شد که تصویبنامه آن در تاریخ ۸/۱۲/۱۳۷۵ به کتابخانه ملی ابلاغ شد و مسئولیت اجرایی طرح بر عهده کتابخانه ملی نهاده شد. در مهر ۱۳۷۷ کتابخانه ملی با همکاری وزارت فرهنگ و ارشاد اسلامی اجرای طرح را به طور رسمی آغاز کرد. اکنون با همراهی و مساعدت ناشران عزیز بیش از ۹۰% از کتابهای منتشر شده در سطح کشور همراه با این اطلاعات منتشر می شوند. تخمین زده می شود که فقط سالانه بیش از یک میلیارد تومان صرفه جویی حاصل اجرای این طرح است.` },
    { id: "vantag", icon: faCheck, label: "فواید فیپا", content: `فیپا (فهرستنویسی پیش از انتشار) باعث یکدستی و هماهنگی در فهرستنویسی شده و امر فهرستنویسی را تسهیل می‌کند. همچنین از انجام کارهای تکراری جلوگیری کرده و سرعت بازیابی منابع در کتابخانه‌ها را افزایش می‌دهد. این فرایند، اطمینان از صحت و درستی کار را بالا برده و با صرفه‌جویی در بودجه، به تسریع اشاعه اطلاعات کمک می‌کند. علاوه بر این، فیپا موجب تسهیل در ایجاد شبکه‌های اطلاعاتی شده و در نهایت، سرعت گردش اطلاعات را افزایش می‌دهد.` },
    { id: "starndard", icon: faGlobe, label: "ضوابط و استاندارد های بین المللی فیپا", content: "فهرستنویسی یک فرآیند علمی و پژوهشی است که امکان دستیابی سریع به مجموعه‌ها را فراهم می‌کند. به همین دلیل، تمامی عملیات انجام‌شده در این فرآیند قانونمند بوده و دستورالعمل‌ها و ابزارهای خاصی برای آن تعریف شده است. از جمله این ابزارها می‌توان به قواعد فهرستنویسی انگلوامریکن، استاندارد بین‌المللی کتابنامه‌نویسی، سرعنوان‌های موضوعی فارسی و رده‌بندی‌های کنگره و دیویی اشاره کرد که هر یک نقش مهمی در سازمان‌دهی و دسترسی به اطلاعات دارند. " },
    { id: "bylaws", icon: faGavel, label: "آئین نامه اجرایی فیپا", content: " پیرو تصویبنامه شماره ۱۲۶۶۷۵/ت ۱۶۴۳۵ هـ مورخ ۸/۱۲/۱۳۷۵ هیئت محترم وزیران که در آن کلیه ناشران دولتی و غیردولتی را موظف به فهرستنویسی پیش از انتشار کتابهای منتشره کرده است و با توجه به بند ۴ این تصویبنامه که مسئولیت تایید نهایی فهرستهای تهیه شده و همچنین تعیین ضوابط اجرایی آنرا به عهده کتابخانه ملی محول کرده است." },
    { id: "steps", icon: faTasks, label: " مراحل کار فیپا", content: "فرآیند فیپا شامل مراحل مشخص و قانونمندی است که بین ۳ تا ۶ روز زمان می‌برد. ابتدا ناشر کتاب و مدارک لازم را تحویل داده و فرم پرسشنامه را تکمیل می‌کند. این فرم توسط کتابخانه بررسی و کنترل شده و سپس اطلاعات کتابشناختی در دفتر مخصوص ثبت می‌شود. در ادامه، عملیات فهرستنویسی انجام‌شده و اطلاعات به رایانه وارد می‌شود تا برگه فهرستنویسی تهیه گردد. پس از آن، کتاب همراه با کارت فهرستنویسی به ناشر تحویل داده می‌شود. ناشر باید نمونه‌ای از کتاب را که می‌تواند متن ماشین‌شده بدون جلد باشد، با صفحه عنوان کامل و دقیق به دفتر فیپا تحویل دهد. در صورت ترجمه بودن کتاب، تصویر صفحه عنوان به زبان اصلی نیز مورد نیاز است و نمونه اوزالید کتاب پذیرفته می‌شود. اگر کتاب تجدید چاپ بدون ویرایش باشد، ارائه چاپ‌های قبلی بلامانع است. بعد از تکمیل فرم پرسشنامه و ثبت اطلاعات مورد نیاز، دفتر فیپا اطلاعات را کنترل کرده و پس از رفع نقص، اطلاعات کتابشناختی در دفتر مخصوص یادداشت و برای فهرستنویسی ارسال می‌شود. پس از ورود ماشینی اطلاعات و دریافت کاربرگه فهرستنویسی، کارت ماشینی فهرستنویسی تهیه و پس از کنترل نهایی همراه با نمونه کتاب به ناشر تحویل داده می‌شود. " },
    { id: "need", icon: faRedo, label: "موارد نیاز به فهرست نویسی مجدد", content: "موارد نیاز به فهرستنویسی مجدد شامل تغییر عنوان، تغییر نام مترجم، اضافه یا کم شدن مترجم‌ها، تغییر نام ناشر، اضافه یا کم شدن ناشران، تغییر یا حذف و اضافه شدن فروست، اضافه یا کم شدن تعداد صفحات کتاب، ویراست کتاب و تغییر قطع کتاب می‌شود. علاوه بر این موارد، هر عنوانی که تجدید چاپ می‌شود باید مجدداً در برگه دان کتابخانه ملی و کتابشناسی ملی الکترونیکی ضبط گردد." }
  ]

  return (
    <div className={styled.fipaContainer}>
      <NavBar/>
      <section className={styled.main}>
        <div className={styled.container}>

          <div className={styled.list}>
            {tabs.map((tab) => (
              <label key={tab.id} className={`${tab.id} ${activeTab === tab.id ? styled.active : ""}`} onClick={() => setActiveTab(tab.id)}>
                <FontAwesomeIcon className={styled.icon} icon={tab.icon} />
                <span>{tab.label}</span>
              </label>
            ))}
          </div>
          <div className={styled.mainContent}>
            {tabs.map((tab) => (
              <div key={tab.id} className={`text ${tab.id} ${activeTab === tab.id ? styled.show : styled.hide} `}>
                <p>{tab.content}</p>
              </div>
            ))}
          </div>
        </div>
      </section>
    </div>
  )
}